"""Ввести с клавиатуры строку.
Вывести эту же строку вертикально: по одному символу на строку консоли."""


line = input('Введите строку: \n')
for x in line:
    print(x)